12/data/attachments/d837a34378a9b3a9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_679213f0-1ef1-4869-9c54-b1670eafb22c</nif:username>
            <nif:friendToBeAdded>Michael_hour_Friend_28724_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>